#ifndef TORNADO_h
#define TORNADO_h
//-------------------ПАРАМЕТРЫ--------------------------------------------------------------------------------
#ifdef FK63
//Требует настройки
#define SPEED_TORNADO  	90 //Скорость вращения в режиме Tornado
#define SPEED_BACK_1  	200 //Скорость заднего хода при манёвре ухода от атаки соперника на первом этапе
#define SPEED_BACK_2  	130 //Скорость заднего хода при манёвре ухода от атаки соперника на втором этапе
#define K_BACK_LR		50 //Коэффициент дуги левой или правой для движения задним ходом		

#define T_TORNADO     		1000 //Максимальная продолжительность режима Tornado [ms]
#define T_RRLL         		600 //Максимальная продолжительность обнаружения цели боковыми датчиками. Показывает, что тебя атакуют в бок [ms]
#define T_TORNADO_BACK 		150//Продолжительность заднего хода прямо при манёвре ухода от атаки соперника [ms]
#define T_TORNADO_BACK_LR 	350//Продолжительность заднего хода L или R при манёвре ухода от атаки соперника [ms]

#define K_TORNADO_R 45 //минимальное значение результата АЦП по правому датчику при обнаружении цели.
#define K_TORNADO_L 45 //минимальное значение результата АЦП по левому датчику при обнаружении цели.
#define K_RR_LL     110 //Пороговое значение боковых датчиков при котором делаем анализ длительности обнаружения цели.

#endif //FK63

#ifdef FK35
//Требует настройки
#define SPEED_TORNADO  	55 //Скорость вращения в режиме Tornado
#define SPEED_BACK_1  	140 //Скорость заднего хода при манёвре ухода от атаки соперника на первом этапе
#define SPEED_BACK_2  	130 //Скорость заднего хода при манёвре ухода от атаки соперника на втором этапе
#define K_BACK_LR		50 //Коэффициент дуги левой или правой для движения задним ходом		

#define T_TORNADO     		1000 //Максимальная продолжительность режима Tornado [ms]
#define T_RRLL         		600 //Максимальная продолжительность обнаружения цели боковыми датчиками. Показывает, что тебя атакуют в бок [ms]
#define T_TORNADO_BACK 		150//Продолжительность заднего хода прямо при манёвре ухода от атаки соперника [ms]
#define T_TORNADO_BACK_LR 	350//Продолжительность заднего хода L или R при манёвре ухода от атаки соперника [ms]

#define K_TORNADO_R 45 //минимальное значение результата АЦП по правому датчику при обнаружении цели.
#define K_TORNADO_L 45 //минимальное значение результата АЦП по левому датчику при обнаружении цели.
#define K_RR_LL     82 //Пороговое значение боковых датчиков при котором делаем анализ длительности обнаружения цели.

#endif //FK35

#ifdef JS400
//Требует настройки
#define SPEED_TORNADO  	100 //Скорость вращения в режиме Tornado
#define SPEED_BACK_1  	200 //Скорость заднего хода при манёвре ухода от атаки соперника на первом этапе
#define SPEED_BACK_2  	130 //Скорость заднего хода при манёвре ухода от атаки соперника на втором этапе
#define K_BACK_LR		50 //Коэффициент дуги левой или правой для движения задним ходом		

#define T_TORNADO     		1000 //Максимальная продолжительность режима Tornado [ms]
#define T_RRLL         		600 //Максимальная продолжительность обнаружения цели боковыми датчиками. Показывает, что тебя атакуют в бок [ms]
#define T_TORNADO_BACK 		150//Продолжительность заднего хода прямо при манёвре ухода от атаки соперника [ms]
#define T_TORNADO_BACK_LR 	350//Продолжительность заднего хода L или R при манёвре ухода от атаки соперника [ms]

#define K_TORNADO_R 48 //минимальное значение результата АЦП по правому датчику при обнаружении цели.
#define K_TORNADO_L 48 //минимальное значение результата АЦП по левому датчику при обнаружении цели.
#define K_RR_LL     82 //Пороговое значение боковых датчиков при котором делаем анализ длительности обнаружения цели.

#endif //JS400

#ifdef CHINA300
//Требует настройки
#define SPEED_TORNADO  	70 //Скорость вращения в режиме Tornado
#define SPEED_BACK_1  	200 //Скорость заднего хода при манёвре ухода от атаки соперника на первом этапе
#define SPEED_BACK_2  	130 //Скорость заднего хода при манёвре ухода от атаки соперника на втором этапе
#define K_BACK_LR		50 //Коэффициент дуги левой или правой для движения задним ходом		

#define T_TORNADO     		1000 //Максимальная продолжительность режима Tornado [ms]
#define T_RRLL         		600 //Максимальная продолжительность обнаружения цели боковыми датчиками. Показывает, что тебя атакуют в бок [ms]
#define T_TORNADO_BACK 		150//Продолжительность заднего хода прямо при манёвре ухода от атаки соперника [ms]
#define T_TORNADO_BACK_LR 	350//Продолжительность заднего хода L или R при манёвре ухода от атаки соперника [ms]

#define K_TORNADO_R 48 //минимальное значение результата АЦП по правому датчику при обнаружении цели.
#define K_TORNADO_L 48 //минимальное значение результата АЦП по левому датчику при обнаружении цели.
#define K_RR_LL     82 //Пороговое значение боковых датчиков при котором делаем анализ длительности обнаружения цели.

#endif //CHINA300
//-----------------------------------------------------------------------------------------------------------

extern void ProcessFSM_TORNADO (void);
#endif
