#ifndef FSM_Go_h
#define FSM_Go_h

//-------------------ПАРАМЕТРЫ--------------------------------------------------------------------------------
#ifdef FK63
//Требует настройки
#define SPEED_F    		135 //Скорость движения вперёд
#define SPEED_FAST 		150 //Максимальная скорость движения вперёд
#define SPEED_B    		150 //Скорость движения задним ходом
#define SPEED_B1   		160 //Максимальная скорость движения задним ходом
#define SPEED_GO_ROTATION	90 //Медленное вращение 1
#define FORWARD_L  		65 //коэффициент правой дуги при движении в атаке.
#define FORWARD_R  		65 //коэффициент левой дуги при движении в атаке.
#define BACK_L     		75 //коэффициент левой дуги при отъезде от края ринга.
#define BACK_R     		75 //коэффициент правой дуги при отъезде от края ринга.
#define T_REVERS    	20 //время смнеы направления вращения двигателя ms.
#define T_B        		300 //продолжительность заднего хода при отъезде от края ринга ms.
#define T_SENSOR     	6 //время выдержки для защиты от "дребезга" датчиков линии ms.
#define T_ROTATION 		1000 //максимальная продолжительность доворота к цели в атаке ms.

#define K_ADCH_L		45 // минимальное значения АЦП по левому датчику при обнаружении цели.
#define K_ADCH_R		45 // минимальное значения АЦП по правому датчику при обнаружении цели (значение 23 в регистре ADCH соответствует уровню сигнала 0,45V)
#define K_ADCH_LL		45 // минимальное значения АЦП по боковому левому датчику при обнаружении цели.
#define K_ADCH_RR		45 // минимальное значения АЦП по боковому правому датчику при обнаружении цели.

#define K_FRONT_DIST		100 //Значение АЦП при лобовой атке ковш в ковш
#define T_FRONT_CONTACT     900 //Временная отсечка фронтального контакта. Определяю, что соперник на ковше [ms]

#endif //FK63

#ifdef FK35
//Требует настройки
#define SPEED_F    		110 //Скорость движения вперёд
#define SPEED_FAST 		150 //Максимальная скорость движения вперёд
#define SPEED_B    		120 //Скорость движения задним ходом
#define SPEED_B1   		140 //Максимальная скорость движения задним ходом
#define SPEED_GO_ROTATION	55 //Медленное вращение 1
#define FORWARD_L  		50 //коэффициент правой дуги при движении в атаке.
#define FORWARD_R  		50 //коэффициент левой дуги при движении в атаке.
#define BACK_L     		75 //коэффициент левой дуги при отъезде от края ринга.
#define BACK_R     		75 //коэффициент правой дуги при отъезде от края ринга.
#define T_REVERS    	20 //время смнеы направления вращения двигателя ms.
#define T_B        		350 //продолжительность заднего хода при отъезде от края ринга ms.
#define T_SENSOR     	6 //время выдержки для защиты от "дребезга" датчиков линии ms.
#define T_ROTATION 		1000 //максимальная продолжительность доворота к цели в атаке ms.

#define K_ADCH_L		45 // минимальное значения АЦП по левому датчику при обнаружении цели.
#define K_ADCH_R		45 // минимальное значения АЦП по правому датчику при обнаружении цели (значение 23 в регистре ADCH соответствует уровню сигнала 0,45V)
#define K_ADCH_LL		45 // минимальное значения АЦП по боковому левому датчику при обнаружении цели.
#define K_ADCH_RR		45 // минимальное значения АЦП по боковому правому датчику при обнаружении цели.

#define K_FRONT_DIST		100 //Значение АЦП при лобовой атке ковш в ковш
#define T_FRONT_CONTACT     900 //Временная отсечка фронтального контакта. Определяю, что соперник на ковше [ms]

#endif //FK35

#ifdef JS400
//Требует настройки
#define SPEED_F    		135 //Скорость движения вперёд
#define SPEED_FAST 		150 //Максимальная скорость движения вперёд
#define SPEED_B    		150 //Скорость движения задним ходом
#define SPEED_B1   		160 //Максимальная скорость движения задним ходом
#define SPEED_GO_ROTATION	100 //Медленное вращение 1
#define FORWARD_L  		65 //коэффициент правой дуги при движении в атаке.
#define FORWARD_R  		65 //коэффициент левой дуги при движении в атаке.
#define BACK_L     		75 //коэффициент левой дуги при отъезде от края ринга.
#define BACK_R     		75 //коэффициент правой дуги при отъезде от края ринга.
#define T_REVERS    	20 //время смнеы направления вращения двигателя ms.
#define T_B        		300 //продолжительность заднего хода при отъезде от края ринга ms.
#define T_SENSOR     	6 //время выдержки для защиты от "дребезга" датчиков линии ms.
#define T_ROTATION 		1000 //максимальная продолжительность доворота к цели в атаке ms.

#define K_ADCH_L		45 // минимальное значения АЦП по левому датчику при обнаружении цели.
#define K_ADCH_R		45 // минимальное значения АЦП по правому датчику при обнаружении цели (значение 23 в регистре ADCH соответствует уровню сигнала 0,45V)
#define K_ADCH_LL		45 // минимальное значения АЦП по боковому левому датчику при обнаружении цели.
#define K_ADCH_RR		45 // минимальное значения АЦП по боковому правому датчику при обнаружении цели.

#define K_FRONT_DIST		100 //Значение АЦП при лобовой атке ковш в ковш
#define T_FRONT_CONTACT     900 //Временная отсечка фронтального контакта. Определяю, что соперник на ковше [ms]

#endif //JS400

#ifdef CHINA300
//Требует настройки
#define SPEED_F    		150 //Скорость движения вперёд
#define SPEED_FAST 		170 //Максимальная скорость движения вперёд
#define SPEED_B    		150 //Скорость движения задним ходом
#define SPEED_B1   		160 //Максимальная скорость движения задним ходом
#define SPEED_GO_ROTATION	50 //Медленное вращение 1
#define FORWARD_L  		80 //коэффициент правой дуги при движении в атаке.
#define FORWARD_R  		80 //коэффициент левой дуги при движении в атаке.
#define BACK_L     		75 //коэффициент левой дуги при отъезде от края ринга.
#define BACK_R     		75 //коэффициент правой дуги при отъезде от края ринга.
#define T_REVERS    	20 //время смнеы направления вращения двигателя ms.
#define T_B        		300 //продолжительность заднего хода при отъезде от края ринга ms.
#define T_SENSOR     	6 //время выдержки для защиты от "дребезга" датчиков линии ms.
#define T_ROTATION 		1000 //максимальная продолжительность доворота к цели в атаке ms.

#define K_ADCH_L		55 // минимальное значения АЦП по левому датчику при обнаружении цели.
#define K_ADCH_R		55 // минимальное значения АЦП по правому датчику при обнаружении цели (значение 23 в регистре ADCH соответствует уровню сигнала 0,45V)
#define K_ADCH_LL		55 // минимальное значения АЦП по боковому левому датчику при обнаружении цели.
#define K_ADCH_RR		55 // минимальное значения АЦП по боковому правому датчику при обнаружении цели.

#define K_FRONT_DIST		100 //Значение АЦП при лобовой атке ковш в ковш
#define T_FRONT_CONTACT     900 //Временная отсечка фронтального контакта. Определяю, что соперник на ковше [ms]

#endif //CHINA300
//-------------------------------------------------------------------------------------------------------------
extern uint8_t PIN_C; //переменная в которой остануться биты (PC0,PC1)датчиков LH,RH. Контроль края ринга.

extern void InitFSM_Go (void);
extern void ProcessFSM_Go (void);

#endif
