#ifndef START_h
#define START_h

//--------------------ПАРАМЕТРЫ СТАРТА ПО ДУГЕ---------------------------------------------
#ifdef FK63
//Подготовлены к предварительным испытаниям
#define SPEED_START_1 		110
#define SPEED_START_2 		165
#define SPEED_START_3 		130
#define SPEED_START_SLOW	50
#define SPEED_START_FAST	130

#define K_ADCH_START_L		45 // минимальное значения АЦП по левому датчику при обнаружении цели.
#define K_ADCH_START_R		45 // минимальное значения АЦП по правому датчику при обнаружении цели (значение 23 в регистре ADCH соответствует уровню сигнала 0,45V)
#define K_ADCH_START_LL		60 // минимальное значения АЦП по боковому левому датчику при обнаружении цели.
#define K_ADCH_START_RR		60 // минимальное значения АЦП по боковому правому датчику при обнаружении цели.

#define START_L       		40 //коэффициент ПРАВОЙ дуги при старте.
#define START_R       		40 //коэффициент ЛЕВОЙ дуги при старте.
#define K_LINE_L			0 //коэффициент прямолинейного движения на ЛЕВЫЙ двигатель
#define K_LINE_R			0 //коэффициент прямолинейного движения на ПРАВЫЙ двигатель

#define T_START_R_1   225 //длительность первого ПРАВОГО манёвра при старте.
#define T_START_R_2   750 //длительность второго ПРАВОГО манёвра при старте.
#define T_START_R_3   300 //длительность третьего ПРАВОГО манёвра при старте.

#define T_START_L_1   225 //длительность первого ЛЕВОГО манёвра при старте.
#define T_START_L_2   700 //длительность второго ЛЕВОГО манёвра при старте.
#define T_START_L_3   300 //длительность третьего ЛЕВОГО манёвра при старте.

#define T_START_SLOW 			1400 //длительность прямого входа в ринг на малой скорости
#define T_START_FAST 			500 //длительность прямого входа в ринг на большой скорости
#define T_START_SLOW_IGNORE		300	//длительность начального момента входа без контроля датчиков
#define T_START_FAST_IGNORE		200 //длительность начального момента входа без контроля датчиков

#endif //FK63

#ifdef FK35
//Требует настройки
#define SPEED_START_1 		90
#define SPEED_START_2 		130
#define SPEED_START_3 		130
#define SPEED_START_SLOW	50
#define SPEED_START_FAST	200

#define K_ADCH_START_L		45 // минимальное значения АЦП по левому датчику при обнаружении цели.
#define K_ADCH_START_R		45 // минимальное значения АЦП по правому датчику при обнаружении цели (значение 23 в регистре ADCH соответствует уровню сигнала 0,45V)
#define K_ADCH_START_LL		55 // минимальное значения АЦП по боковому левому датчику при обнаружении цели.
#define K_ADCH_START_RR		55 // минимальное значения АЦП по боковому правому датчику при обнаружении цели.

#define START_L       		60 //коэффициент ПРАВОЙ дуги при старте.
#define START_R       		60 //коэффициент ЛЕВОЙ дуги при старте.
#define K_LINE_L			0 //коэффициент прямолинейного движения на ЛЕВЫЙ двигатель
#define K_LINE_R			10 //коэффициент прямолинейного движения на ПРАВЫЙ двигатель

#define T_START_R_1   200 //длительность первого ПРАВОГО манёвра при старте.
#define T_START_R_2   700 //длительность второго ПРАВОГО манёвра при старте.
#define T_START_R_3   100 //длительность третьего ПРАВОГО манёвра при старте.

#define T_START_L_1   225 //длительность первого ЛЕВОГО манёвра при старте.
#define T_START_L_2   700 //длительность второго ЛЕВОГО манёвра при старте.
#define T_START_L_3   100 //длительность третьего ЛЕВОГО манёвра при старте.

#define T_START_SLOW 			1200 //длительность прямого входа в ринг на малой скорости
#define T_START_FAST 			300 //длительность прямого входа в ринг на большой скорости
#define T_START_SLOW_IGNORE		250	//длительность начального момента входа без контроля датчиков
#define T_START_FAST_IGNORE		200 //длительность начального момента входа без контроля датчиков

#endif //FK35

#ifdef JS400
//Подготовлены к предварительным испытаниям
#define SPEED_START_1 		110
#define SPEED_START_2 		165
#define SPEED_START_3 		130
#define SPEED_START_SLOW	50
#define SPEED_START_FAST	130

#define K_ADCH_START_L		50 // минимальное значения АЦП по левому датчику при обнаружении цели.
#define K_ADCH_START_R		50 // минимальное значения АЦП по правому датчику при обнаружении цели (значение 23 в регистре ADCH соответствует уровню сигнала 0,45V)
#define K_ADCH_START_LL		60 // минимальное значения АЦП по боковому левому датчику при обнаружении цели.
#define K_ADCH_START_RR		60 // минимальное значения АЦП по боковому правому датчику при обнаружении цели.

#define START_L       		45 //коэффициент ПРАВОЙ дуги при старте.
#define START_R       		55 //коэффициент ЛЕВОЙ дуги при старте.
#define K_LINE_L			0 //коэффициент прямолинейного движения на ЛЕВЫЙ двигатель
#define K_LINE_R			10 //коэффициент прямолинейного движения на ПРАВЫЙ двигатель

#define T_START_R_1   225 //длительность первого ПРАВОГО манёвра при старте.
#define T_START_R_2   680 //длительность второго ПРАВОГО манёвра при старте.
#define T_START_R_3   300 //длительность третьего ПРАВОГО манёвра при старте.

#define T_START_L_1   225 //длительность первого ЛЕВОГО манёвра при старте.
#define T_START_L_2   700 //длительность второго ЛЕВОГО манёвра при старте.
#define T_START_L_3   300 //длительность третьего ЛЕВОГО манёвра при старте.

#define T_START_SLOW 			1400 //длительность прямого входа в ринг на малой скорости
#define T_START_FAST 			500 //длительность прямого входа в ринг на большой скорости
#define T_START_SLOW_IGNORE		300	//длительность начального момента входа без контроля датчиков
#define T_START_FAST_IGNORE		200 //длительность начального момента входа без контроля датчиков

#endif //JS400

#ifdef CHINA300
//Подготовлены к предварительным испытаниям
#define SPEED_START_1 		125
#define SPEED_START_2 		165
#define SPEED_START_3 		130
#define SPEED_START_SLOW	100
#define SPEED_START_FAST	170

#define K_ADCH_START_L		45 // минимальное значения АЦП по левому датчику при обнаружении цели.
#define K_ADCH_START_R		45 // минимальное значения АЦП по правому датчику при обнаружении цели (значение 23 в регистре ADCH соответствует уровню сигнала 0,45V)
#define K_ADCH_START_LL		45 // минимальное значения АЦП по боковому левому датчику при обнаружении цели.
#define K_ADCH_START_RR		45 // минимальное значения АЦП по боковому правому датчику при обнаружении цели.

#define START_L       		45 //коэффициент ПРАВОЙ дуги при старте.
#define START_R       		45 //коэффициент ЛЕВОЙ дуги при старте.
#define K_LINE_L			0 //коэффициент прямолинейного движения на ЛЕВЫЙ двигатель
#define K_LINE_R			10 //коэффициент прямолинейного движения на ПРАВЫЙ двигатель

#define T_START_R_1   225 //длительность первого ПРАВОГО манёвра при старте.
#define T_START_R_2   680 //длительность второго ПРАВОГО манёвра при старте.
#define T_START_R_3   100 //длительность третьего ПРАВОГО манёвра при старте.

#define T_START_L_1   225 //длительность первого ЛЕВОГО манёвра при старте.
#define T_START_L_2   700 //длительность второго ЛЕВОГО манёвра при старте.
#define T_START_L_3   200 //длительность третьего ЛЕВОГО манёвра при старте.

#define T_START_SLOW 			1400 //длительность прямого входа в ринг на малой скорости
#define T_START_FAST 			500 //длительность прямого входа в ринг на большой скорости
#define T_START_SLOW_IGNORE		150	//длительность начального момента входа без контроля датчиков
#define T_START_FAST_IGNORE		80 //длительность начального момента входа без контроля датчиков

#endif //CHINA300
//-----------------------------------------------------------------------------------------
#define T_INIT       5000 //задержка 5с при старте

extern uint8_t start_state;

extern void InitFSM_START (void);
extern void ProcessFSM_START (void);

#endif
